[
  {
    "id": 1,
    "slug": "plc-nedir-nasil-calisir",
    "title": "PLC Nedir? Programlanabilir Mantık Kontrolörlerinin Tam Rehberi",
    "excerpt": "Endüstriyel otomasyonun kalbi olan PLC'lerin çalışma prensiplerini, kullanım alanlarını ve seçim kriterlerini detaylı inceleyin.",
    "content": "PLC (Programmable Logic Controller), endüstriyel otomasyon sistemlerinin beynidir. Üretim hatlarından enerji santrallerine kadar geniş bir yelpazede kullanılan bu cihazlar, makineleri ve süreçleri hassas bir şekilde kontrol eder.\n\n## PLC'nin Temel Bileşenleri\n\nBir PLC üç ana bileşenden oluşur: CPU (işlemci), giriş/çıkış modülleri ve programlama ara birimi. CPU, kullanıcı tarafından yazılan programı çalıştırır ve tüm işlemleri koordine eder.\n\n## PLC Programlama Dilleri\n\nIEC 61131-3 standardı 5 programlama dili tanımlar:\n- Ladder Diagram (LD)\n- Structured Text (ST)\n- Function Block Diagram (FBD)\n- Sequential Function Chart (SFC)\n- Instruction List (IL)\n\n## Popüler PLC Markaları\n\nSiemens, Allen Bradley, Mitsubishi ve Schneider Electric sektörün lider markaları arasındadır. Her birinin kendine özgü güçlü yanları ve uygulama alanları vardır.\n\n## PLC Seçim Kriterleri\n\nDoğru PLC seçimi için giriş/çıkış sayısı, bellek kapasitesi, iletişim protokolleri ve genişleme imkanları değerlendirilmelidir.",
    "image": "/images/blog/plc-control.jpg",
    "category": "Otomasyon",
    "tags": ["PLC", "Endüstriyel Otomasyon", "Siemens", "Programlama"],
    "author": "Mert Kahraman",
    "authorRole": "Otomasyon Mühendisi",
    "date": "2024-11-22",
    "readTime": "8 dk"
  },
  {
    "id": 2,
    "slug": "scada-sistemleri-nedir",
    "title": "SCADA Sistemleri: Endüstriyel İzleme ve Kontrol Teknolojisi",
    "excerpt": "SCADA sistemlerinin fabrika genelindeki rolünü, avantajlarını ve modern SCADA çözümlerini keşfedin.",
    "content": "SCADA (Supervisory Control and Data Acquisition), endüstriyel tesislerin merkezi izleme ve kontrol sistemleridir. Gerçek zamanlı veri toplama, analiz ve raporlama yetenekleriyle üretim verimliliğini artırır.\n\n## SCADA'nın Ana Özellikleri\n\nGerçek zamanlı izleme, alarm yönetimi, trend analizi ve uzaktan erişim SCADA'nın temel özellikleridir. Modern SCADA sistemleri cloud tabanlı çözümler ve mobil erişim sunmaktadır.\n\n## HMI ile Farkı\n\nHMI tek bir makineyi kontrol ederken, SCADA tüm tesisi yönetir. SCADA daha kapsamlı veri saklama, raporlama ve analiz yeteneklerine sahiptir.\n\n## Endüstri 4.0 ve SCADA\n\nYeni nesil SCADA sistemleri IoT sensörleri, yapay zeka ve büyük veri analitiği ile entegre çalışmaktadır. Predictive maintenance ve enerji optimizasyonu gibi gelişmiş özellikler sunmaktadır.\n\n## Popüler SCADA Yazılımları\n\nWonderware, Ignition, Siemens WinCC ve Schneider Citect sektörün önde gelen SCADA çözümleridir.",
    "image": "/images/blog/scada-system.jpg",
    "category": "Otomasyon",
    "tags": ["SCADA", "HMI", "Endüstri 4.0", "İzleme Sistemleri"],
    "author": "Baran Hasret",
    "authorRole": "Sistem Entegratörü",
    "date": "2024-11-20",
    "readTime": "7 dk"
  },
  {
    "id": 3,
    "slug": "servo-motor-vs-step-motor",
    "title": "Servo Motor ve Step Motor: Hangi Uygulamada Hangisi?",
    "excerpt": "Motion control uygulamalarında doğru motor seçimi için servo ve step motorların karşılaştırmalı analizi.",
    "content": "Motion control sistemlerinde motor seçimi kritik bir karardır. Servo ve step motorlar farklı avantajlar sunar ve doğru seçim uygulamanın başarısını belirler.\n\n## Step Motor Avantajları\n\nDüşük maliyet, basit sürücü elektroniği ve açık döngü kontrol step motorların başlıca avantajlarıdır. Pozisyon feedback gerektirmez ve duruşta yüksek moment üretir.\n\n## Servo Motor Üstünlükleri\n\nYüksek hız, hassas pozisyon kontrolü ve geniş hız aralığında sabit tork servo motorların güçlü yönleridir. Encoder feedback ile kapalı döngü kontrol sağlar.\n\n## Maliyet Karşılaştırması\n\nStep motor sistemleri başlangıçta 3-5 kat daha ucuzdur. Ancak servo motorlar enerji verimliliği ve üretim hızı ile uzun vadede avantaj sağlar.\n\n## Uygulama Önerileri\n\n3D yazıcılar ve hobi CNC'ler için step motor idealdir. Profesyonel CNC, robotik ve yüksek hızlı paketleme uygulamaları servo motor gerektirir.\n\n## Hibrit Çözüm: Closed-Loop Step Motor\n\nEncoder eklenmiş step motorlar, her iki dünyanın avantajlarını birleştirir ve orta segment uygulamalar için mükemmel bir seçimdir.",
    "image": "/images/blog/servo-step.jpg",
    "category": "Motion Control",
    "tags": ["Servo Motor", "Step Motor", "CNC", "Robotik"],
    "author": "Baran Hasret",
    "authorRole": "Motion Control Uzmanı",
    "date": "2024-11-18",
    "readTime": "9 dk"
  },
  {
    "id": 4,
    "slug": "endustri-4-0-dijital-donusum",
    "title": "Endüstri 4.0: Akıllı Fabrikalar ve Dijital Dönüşüm",
    "excerpt": "Endüstri 4.0 teknolojileri ile üretim tesislerinin dijital dönüşüm yolculuğu ve sağladığı avantajlar.",
    "content": "Endüstri 4.0, fiziksel ve dijital sistemlerin entegrasyonu ile üretimde yeni bir çağı temsil eder. IoT, yapay zeka ve büyük veri analitiği ile fabrikalar akıllı hale gelir.\n\n## Endüstri 4.0 Teknolojileri\n\nIoT sensörleri, cloud computing, yapay zeka, dijital ikiz ve otonom robotlar Endüstri 4.0'ın temel taşlarıdır. Bu teknolojiler gerçek zamanlı veri analitiği ve otomatik karar verme sağlar.\n\n## Faydalar ve ROI\n\nÜretim verimliliğinde %30'a varan artış, enerji tasarrufunda %25, kalite iyileştirmesinde %20 ve bakım maliyetlerinde %25 azalma Endüstri 4.0'ın somut faydalarıdır.\n\n## KOBİ'ler için Yol Haritası\n\nPilot proje ile başlayın, ölçülebilir hedefler belirleyin ve aşamalı implementasyon yapın. Devlet desteklerinden (KOSGEB, TÜBİTAK) yararlanın.\n\n## Predictive Maintenance\n\nTitreşim analizi ve AI algoritmaları ile arıza öncesi müdahale edin. Plansız duruşları %50 azaltın ve ekipman ömrünü uzatın.\n\n## Başarı Hikayeleri\n\nSiemens Amberg fabrikası %75 otomasyon ile 99.9988% kalite oranına ulaşmıştır. Türk KOBİ'leri IoT ile %18 verimlilik artışı elde etmiştir.",
    "image": "/images/blog/industry-40.jpg",
    "category": "Dijitalleşme",
    "tags": ["Endüstri 4.0", "IoT", "Dijital İkiz", "AI"],
    "author": "Mert Kahraman",
    "authorRole": "Endüstri 4.0 Danışmanı",
    "date": "2024-11-15",
    "readTime": "10 dk"
  },
  {
    "id": 5,
    "slug": "vfd-frekans-konvertorleri",
    "title": "VFD Frekans Konvertörleri ile Enerji Tasarrufu",
    "excerpt": "Frekans konvertörlerinin çalışma prensibi, uygulama alanları ve %50'ye varan enerji tasarrufu potansiyeli.",
    "content": "VFD (Variable Frequency Drive), AC motorların hız ve tork kontrolünü sağlayarak enerji tüketimini dramatik şekilde azaltır. Özellikle pompa ve fan uygulamalarında çok büyük tasarruf sağlar.\n\n## VFD Çalışma Prensibi\n\nAC şebeke gerilimi önce DC'ye dönüştürülür, ardından IGBT transistörler ile değişken frekanslı AC'ye çevrilir. PWM kontrol ile hassas hız ayarı yapılır.\n\n## Enerji Tasarrufu Hesabı\n\nAfinity yasasına göre, pompa hızı %80'e düşürüldüğünde güç tüketimi %51'e düşer. Bu, 15 kW pompada yılda 5000€ tasarruf demektir.\n\n## Uygulama Alanları\n\nPompa sistemleri, HVAC fanları, konveyörler, kompresörler ve asansörler VFD'nin en yaygın uygulama alanlarıdır.\n\n## VFD Seçim Kriterleri\n\nMotor gücü, overload kapasitesi, EMI filtresi, brake chopper ihtiyacı ve iletişim protokolleri değerlendirilmelidir.\n\n## Popüler VFD Markaları\n\nSiemens, ABB, Schneider, Danfoss ve Delta sektörün güvenilir VFD üreticileridir. Her biri farklı fiyat/performans seçenekleri sunar.",
    "image": "/images/blog/vfd-inverter.jpg",
    "category": "Otomasyon",
    "tags": ["VFD", "Enerji Tasarrufu", "Motor Kontrolü", "Inverter"],
    "author": "Baran Hasret",
    "authorRole": "Elektrik Mühendisi",
    "date": "2024-11-12",
    "readTime": "8 dk"
  },
  {
    "id": 6,
    "slug": "endustriyel-robotlar-turleri",
    "title": "Endüstriyel Robot Türleri ve Kullanım Alanları",
    "excerpt": "Artiküle, SCARA, Delta ve Collaborative robotların özellikleri, avantajları ve ideal uygulama senaryoları.",
    "content": "Endüstriyel robotlar modern üretimin vazgeçilmez elemanlarıdır. Farklı robot türleri, belirli uygulamalar için optimize edilmiştir ve doğru seçim üretim verimliliğini önemli ölçüde artırır.\n\n## Artiküle Robotlar (6 Eksen)\n\nEn esnek robot türüdür. Kaynak, boyama, paletleme ve malzeme taşımada kullanılır. Yaskawa, ABB ve KUKA lider üreticilerdir.\n\n## SCARA Robotlar\n\nHızlı pick-and-place ve montaj işleri için idealdir. Z ekseninde rijit, XY düzleminde esnektir. Elektronik montaj ve PCB uygulamalarında tercih edilir.\n\n## Delta Robotlar (Paralel)\n\nİnanılmaz hız (300+ pick/dakika) ile gıda paketleme ve ilaç endüstrisinde kullanılır. Hafif yük taşıma ve yüksek hassasiyet avantajı sunar.\n\n## Collaborative Robots (Cobots)\n\nİnsan-robot işbirliği için tasarlanmıştır. Güvenlik sensörleri ile bariyersiz çalışır. Universal Robots ve Techman Robot lider markadır.\n\n## Robot Seçim Kriterleri\n\nYük kapasitesi, erişim mesafesi, hız, hassasiyet ve bütçe değerlendirilmelidir. Uygulama tipine göre (kaynak, montaj, paketleme) uygun robot seçilir.",
    "image": "/images/blog/industrial-robots.jpg",
    "category": "Robotik",
    "tags": ["Endüstriyel Robot", "Cobot", "SCARA", "Delta Robot"],
    "author": "Mert Kahraman",
    "authorRole": "Robotik Uzmanı",
    "date": "2024-11-08",
    "readTime": "7 dk"
  }
]